Repository: RostyslavPas/velpas
Catalog: lib/core/localization/arb/app_*.arb
Languages: uk

# appSubtitle
source: Bike components & gear tracker
uk: Трекер компонентів та екіпірування

# tagline
source: Track your bike. Know your gear.
uk: Контроль велосипеда та екіпірування.

# aboutDescription
source: PROS.TO is a premium cycling app built for riders who care about their equipment. Track mileage and wear for every bike component, keep replacement history, and understand the true cost of your setup. Designed with a dark, minimal interface and warm metallic accents for clarity and focus. Key features: • Bike garage with photos and value • Component mileage & wear tracking • Replacement history and cost insights • Cycling gear wardrobe (helmets, shoes, kits and more) • Offline-first performance • Face ID / Touch ID app lock • English & Ukrainian language support PROS.TO Pro: • Strava sync (automatic mileage updates) • Unlimited bikes and components
uk: PROS.TO — це преміальний застосунок для велосипедистів, які дбають про свою техніку. Трекай пробіг і знос кожного компонента, зберігай історію замін і розумій реальну вартість свого сетапу. Темний мінімалістичний інтерфейс із теплими металевими акцентами створений для зручності та фокусу. Основні можливості: • Гараж велосипедів із фото та вартістю • Трекінг пробігу і зносу компонентів • Історія замін та аналіз витрат • Гардероб екіпірування (шоломи, велотуфлі, форма тощо) • Робота офлайн • Захист через Face ID / Touch ID • Англійська та українська мови PROS.TO Pro: • Синхронізація зі Strava (автоматичний пробіг) • Необмежено велосипедів і компонентів

# homeTitle
source: Home
uk: Головна

# garageTitle
source: Garage
uk: Гараж

# wardrobeTitle
source: Wardrobe
uk: Гардероб

# insightsTitle
source: Insights
uk: Аналітика

# settingsTitle
source: Settings
uk: Налаштування

# settingsTab
source: Settings
uk: Налашт.

# lastSyncTitle
source: Last sync
uk: Остання синхронізація

# lastSyncNever
source: Never synced
uk: Ще не синхронізовано

source: Add replacement
uk: Додати заміну

source: Sync Strava
uk: Синхронізувати Strava

# syncingStrava
source: Syncing...
uk: Синхронізація...

# fullSyncStrava
source: Full sync
uk: Повна синхронізація

# fullSyncConfirmTitle
source: Full sync Strava
uk: Повна синхронізація Strava

# fullSyncConfirmBody
source: This will import all Strava bikes and synchronize their total mileage.
uk: Ця дія імпортує всі велосипеди зі Strava та синхронізує їх загальний пробіг.

# fullSyncConfirmAction
source: Sync all
uk: Синхронізувати

# fullSyncCancelAction
source: Cancel
uk: Скасувати

# connectedStatus
source: Connected
uk: Підключено

# disconnectedStatus
source: Not connected
uk: Не підключено

# proOnlyStatus
source: Pro-only
uk: Лише Pro

# adjustBikeKm
source: Adjust mileage
uk: Змінити пробіг

# currentTotalKmLabel
source: Current total: {km} km
uk: Поточний пробіг: {km} км

# addKmLabel
source: Add km
uk: Додати км

# setTotalKmLabel
source: Set total km
uk: Встановити загальний пробіг

# adjustComponentKm
source: Adjust component mileage
uk: Змінити пробіг компонента

# componentKmLabel
source: Component km since install
uk: Пробіг компонента від встановлення

source: Your bikes
uk: Ваші велосипеди

# emptyGarageTitle
source: No bikes yet
uk: Ще немає велосипедів

# emptyGarageSubtitle
source: Add your first bike to start tracking components.
uk: Додайте перший байк, щоб почати трекінг компонентів.

source: Add bike
uk: Додати велосипед

# totalKmLabel
source: {km} km total
uk: {km} км загалом

source: No components yet
uk: Компонентів ще немає

# alertsTitle
source: Maintenance alerts
uk: Сповіщення про знос

# alertsEmpty
source: No components need attention yet.
uk: Наразі немає компонентів, що потребують уваги.

# topAlertLabel
source: Top alert: {brand} {model} • {wearPercent}%
uk: Топ-алерт: {brand} {model} • {wearPercent}%

# statusOk
source: OK
uk: ОК

# statusWatch
source: Watch
uk: Увага

# statusReplace
source: Replace soon
uk: Скоро заміна

# statusReplaceNow
source: Replace now
uk: Потрібна заміна

# alertTitleWatch
source: Maintenance watch
uk: Потрібна увага

# alertTitleReplace
source: Replacement needed
uk: Потрібна заміна

# alertBodyWatch
source: {component} on {bike} is at {wear}% wear.
uk: {component} на {bike} має знос {wear}%.

# alertBodyReplace
source: {component} on {bike} is at {wear}% wear. Replace soon.
uk: {component} на {bike} має знос {wear}%. Пора замінити.

# alertBodyReplaceNow
source: {component} on {bike} is at {wear}% wear. Replace now.
uk: {component} на {bike} має знос {wear}%. Замініть зараз.

source: Select bike
uk: Оберіть велосипед

source: Select component
uk: Оберіть компонент

# syncSuccess
source: Imported {added} rides • {summary}
uk: Імпортовано {added} поїздок • {summary}

# bikeDetailTitle
source: Bike detail
uk: Деталі велосипеда

source: Bike not found
uk: Велосипед не знайдено

# componentsTitle
source: Components
uk: Компоненти

source: Add component
uk: Додати компонент

# categoryDrivetrain
source: Drivetrain
uk: Трансмісія

# categoryWheelsTires
source: Wheels & Tires
uk: Колеса й шини

# categoryBrakes
source: Brakes
uk: Гальма

# categoryCockpit
source: Cockpit
uk: Кокпіт

# categoryOther
source: Other
uk: Інше

# kmSinceInstall
source: {km} km since install • {expected} km life
uk: {km} км після установки • ресурс {expected} км

# purchasePriceLabel
source: Purchase price: {price}
uk: Ціна покупки: {price}

source: Component type
uk: Тип компонента

# componentTypeChain
source: Chain
uk: Ланцюг

# componentTypeCassette
source: Cassette
uk: Касета

# componentTypeChainring
source: Chainring
uk: Зірка

# componentTypePowerMeter
source: Power meter
uk: Паверметр

# componentTypeShifters
source: Shifters
uk: Манетки

# componentTypeRearDerailleur
source: Rear derailleur
uk: Задній перемикач

# componentTypeFrontDerailleur
source: Front derailleur
uk: Передній перемикач

# componentTypeWheels
source: Wheels
uk: Колеса

# componentTypeTires
source: Tires
uk: Покришки

# componentTypeBrakes
source: Brakes
uk: Гальма

# componentTypeCockpit
source: Handlebar
uk: Руль

# componentTypeStem
source: Stem
uk: Виніс

# componentTypeBarTape
source: Handlebar tape
uk: Обмотка руля

# componentTypeOther
source: Other
uk: Інше

# brandLabel
source: Brand
uk: Бренд

# modelLabel
source: Model
uk: Модель

# componentNameLabel
source: Component name
uk: Назва компонента

# componentDetailsOptionalLabel
source: Details (optional)
uk: Деталі (необов'язково)

# expectedLifeLabel
source: Expected life (km)
uk: Очікуваний ресурс (км)

# priceOptionalLabel
source: Price (optional)
uk: Ціна (необов'язково)

# saveLabel
source: Save
uk: Зберегти

# installedAtKm
source: Installed at {km} km
uk: Встановлено на {km} км

source: Edit bike
uk: Редагувати велосипед

# bikeNameLabel
source: Bike name
uk: Назва велосипеда

# requiredField
source: Required
uk: Обов'язкове

source: Purchase price (optional)
uk: Ціна покупки (необов'язково)

source: Delete bike
uk: Видалити велосипед

# bikePhotoLabel
source: Bike photo
uk: Фото велосипеда

# pickPhoto
source: Tap to pick a photo
uk: Торкніться, щоб додати фото

# photoPickerUnavailable
source: Photo picker is not available on this platform.
uk: Вибір фото недоступний на цій платформі.

# componentDetailTitle
source: Component detail
uk: Деталі компонента

source: Component not found
uk: Компонент не знайдено

source: Replace component
uk: Замінити компонент

source: Replacement history
uk: Історія замін

# noHistory
source: No replacement history yet
uk: Історії замін ще немає

# removedAtKm
source: Removed at {km} km
uk: Знято на {km} км

# removalKmLabel
source: Removal odometer
uk: Пробіг при знятті

# currentBikeKmLabel
source: Current bike km: {km}
uk: Поточний пробіг: {km}

# newComponentTitle
source: New component
uk: Новий компонент

source: Total gear value
uk: Загальна вартість спорядження

# itemsCount
source: {count} items
uk: {count} речей

# categoryHelmets
source: Helmets
uk: Шоломи

# categoryGlasses
source: Glasses
uk: Окуляри

# categoryJerseys
source: Jerseys
uk: Джерсі

# categoryBibs
source: Bibs
uk: Велотруси

# categoryShoes
source: Shoes
uk: Взуття

# categoryGloves
source: Gloves
uk: Рукавички

# categoryJackets
source: Jackets
uk: Куртки

# categoryAccessories
source: Accessories
uk: Аксесуари

# emptyWardrobeCategory
source: No items yet
uk: Ще немає речей

# itemQuantity
source: Qty {quantity}
uk: К-ть {quantity}

source: Add item
uk: Додати річ

source: Edit item
uk: Редагувати річ

# quantityLabel
source: Quantity
uk: Кількість

# notesLabel
source: Notes
uk: Нотатки

source: Delete item
uk: Видалити річ

source: Total bike value
uk: Загальна вартість велосипедів

# totalKmAllBikes
source: Total distance: {km} km
uk: Загальний пробіг: {km} км

# totalGearValueLabel
source: Total gear value: {value}
uk: Вартість спорядження: {value}

source: Per-bike breakdown
uk: По кожному байку

# bikeValueLabel
source: Bike value: {value}
uk: Вартість байка: {value}

# languageTitle
source: Language
uk: Мова

# currencyTitle
source: Currency
uk: Валюта

# currencyUsd
source: US Dollar ($)
uk: Долар США ($)

# currencyEur
source: Euro (€)
uk: Євро (€)

# currencyUah
source: Ukrainian Hryvnia (₴)
uk: Гривня (₴)

# primaryBikeTitle
source: Primary bike
uk: Основний велосипед

# primaryBikeLabel
source: Select primary bike
uk: Виберіть основний велосипед

# primaryBikeNone
source: No primary bike
uk: Без основного велосипеда

# primaryBikeEmpty
source: Add a bike to choose a primary one.
uk: Додайте велосипед, щоб вибрати основний.

# languageUkrainian
source: Ukrainian
uk: Українська

# biometricToggleTitle
source: FaceID/TouchID unlock
uk: Розблокування FaceID/TouchID

# biometricToggleSubtitle
source: Require biometrics on launch
uk: Вимагати біометрію при запуску

# subscriptionTitle
source: Subscription
uk: Підписка

source: Upgrade to Pro
uk: Оновити до Pro

source: Cancel Pro
uk: Скасувати Pro

# proRequiredMessage
source: Available with PROS.TO Pro.
uk: Доступно лише з PROS.TO Pro.

source: Strava connected
uk: Strava підключено

# stravaDisconnected
source: Strava not connected
uk: Strava не підключено

# stravaLocked
source: Strava sync is Pro-only
uk: Синхронізація Strava лише для Pro

# stravaConnectRequired
source: Connect Strava to sync.
uk: Підключіть Strava для синхронізації.

# stravaSessionExpired
source: Strava session expired. Please reconnect.
uk: Сесія Strava завершилась. Підключіть знову.

# stravaSyncFailed
source: Strava sync failed. Try again.
uk: Синхронізація Strava не вдалася. Спробуйте ще раз.

# stravaAuthFailed
source: Unable to open Strava. Try again.
uk: Не вдалося відкрити Strava. Спробуйте ще раз.

# stravaImporting
source: Importing Strava bikes...
uk: Імпорт велосипедів зі Strava...

# stravaImportBikes
source: Import bikes from Strava
uk: Імпортувати велосипеди зі Strava

# stravaImportFailed
source: Strava import failed. Try again.
uk: Імпорт Strava не вдався. Спробуйте ще раз.

# stravaImportResult
source: Imported {added}, linked {linked}, skipped {skipped}.
uk: Імпортовано {added}, повʼязано {linked}, пропущено {skipped}.

source: Connect Strava
uk: Підключити Strava

source: Disconnect Strava
uk: Відключити Strava

# accountTitle
source: Account
uk: Акаунт

# phoneAuthStub
source: Phone login is coming soon.
uk: Вхід за номером телефону скоро.

# openAuth
source: Open login
uk: Відкрити вхід

# aboutTitle
source: About
uk: Про застосунок

# versionLabel
source: Version {version}
uk: Версія {version}

# proSubtitle
source: Unlock premium maintenance and sync features.
uk: Відкрийте преміум-функції та синхронізацію.

# proBenefitStrava
source: Strava sync
uk: Синхронізація Strava

# proBenefitUnlimited
source: Unlimited bikes & components
uk: Необмежені велосипеди й компоненти

# proBenefitAlerts
source: Smart maintenance alerts
uk: Розумні сповіщення

# proPrice
source: $5 / month
uk: $5 / місяць

# proPriceNote
source: Cancel anytime
uk: Скасування будь-коли

source: Start Pro
uk: Почати Pro

source: Restore purchases
uk: Відновити покупки

# phoneAuthTitle
source: Phone registration
uk: Реєстрація за телефоном

# phoneAuthSubtitle
source: Sign in with your phone number (stub)
uk: Вхід за номером телефону (заглушка)

# phoneNumberLabel
source: Phone number
uk: Номер телефону

# otpLabel
source: Code
uk: Код

# continueLabel
source: Continue
uk: Продовжити

# unlockTitle
source: Unlock PROS.TO
uk: Розблокувати PROS.TO

# unlockSubtitle
source: Use biometrics to continue
uk: Використайте біометрію для входу

# unlockAction
source: Unlock
uk: Розблокувати

# unlockReason
source: Authenticate to unlock PROS.TO
uk: Підтвердіть особу, щоб розблокувати PROS.TO

# unlockDisableBiometrics
source: Disable biometrics
uk: Вимкнути біометрію
